# HighlightedElementFamRefsInvalidWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..HighlightedElementFamRefsInvalidWarning Property
BuiltInFailures..::..FamilyFailures Class See Also
---
One or more references of the highlighted element have become invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HighlightedElementFamRefsInvalidWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HighlightedElementFamRefsInvalidWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HighlightedElementFamRefsInvalidWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace